cf_billing/Documents/энргБанкротство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргБанкротство</Name>
			<BasedOn>
				<xr:Item>Task.энргЗадачаПИД</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗабалансоваяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодачиЗаявленияВСудОБанкротсве</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликацииОБанкротстве</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнанБанкротом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПричиныСписанияЗадолжености</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргБанкротство/Forms/ФормаДокументаСписаниеНаЗабаланс/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Организация, Район, Строение, Абонент, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец;  
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргБанкротство(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОпределитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПараметрыСудебныеЗаседания();
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("Организация", Организация) Тогда
			Объект.Организация = Организация;
		КонецЕсли;
		Если Параметры.Свойство("Район", Район) Тогда
			Объект.Район = Район;
		КонецЕсли;
		Если Параметры.Свойство("Строение", Строение) Тогда
			Объект.Строение = Строение;
		КонецЕсли;
		Если Параметры.Свойство("Абонент", Абонент) Тогда
			Объект.Абонент = Абонент;
			Объект.Дата = ТекущаяДатаСеанса();
			Параметры.Свойство("ПериодЗадолженностиНачало", ПериодЗадолженностиНачало);
			Параметры.Свойство("ПериодЗадолженностиКонец", ПериодЗадолженностиКонец);
			РезультатЗапроса = Документы.энргБанкротство.ПолучитьЗадолженность(Объект, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец);
			Объект.ДанныеСписания.Загрузить(РезультатЗапроса.Выгрузить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПараметрыСудебныеЗаседания();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.Организация	= Неопределено;
		Объект.Район		= Неопределено;
		Объект.Строение		= Неопределено;
		Объект.ДанныеСписания.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ОпределитьПериодНачисления();
	КонецЕсли;
КонецПроцедуры

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПодборЗадолженностиЗавершение(РезультатЗакрытия,ДополнительныеПараметры) Экспорт 
	   ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия);	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	 ОбработатьВыбранныеСтрокиДанныеЗадолженности(ВыбранноеЗначение);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия) 
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСтроки  							= Новый ФиксированнаяСтруктура("ПериодЗадолженности,Услуга,Поставщик");
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") тогда
		для Каждого строка из РезультатЗакрытия цикл
			СтруктураПоиска 					= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, строка);
			Строки  							= Объект.ДанныеСписания.НайтиСтроки(СтруктураПоиска);
			Если Строки.количество()  = 1 тогда
				СтрокаТЧ  						= Строки[0];
			иначе                                
				СтрокаТЧ  						= Объект.ДанныеСписания.Добавить(); 
			КонецЕсли; 			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, строка);
		КонецЦикла;		
	иначе
		СтруктураПоиска 						= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, РезультатЗакрытия);
		Строки  								= Объект.ДанныеСписания.НайтиСтроки(СтруктураПоиска);
		Если Строки.количество()  = 1 тогда
			СтрокаТЧ  							= Строки[0];
		иначе                                
			СтрокаТЧ  							= Объект.ДанныеСписания.Добавить(); 
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,РезультатЗакрытия);
	КонецЕсли;  	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСудебныеЗаседания()
	ПолеДело = Новый ПолеКомпоновкиДанных("Дело");
	Для каждого ТекЭлем Из СудебныеЗаседания.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОпределитьПериодНачисления()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры	

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуПодбораСписаниеЗадолженности(Команда) 	
	ПараметрыПодбора  					= Новый Структура("Организация, Район, Строение, Абонент, Дата, СписаниеНаЗабаланс");
	ЗаполнитьЗначенияСвойств(ПараметрыПодбора, Объект);
	ПараметрыПодбора.СписаниеНаЗабаланс = Истина;
	ОписаниеОповещения 					= Новый ОписаниеОповещения("ПодборЗадолженностиЗавершение",ЭтотОбъект);
	ОткрытьФорму("Документ.энргБанкротство.Форма.ФормаПодбораЗадолженности",ПараметрыПодбора,Элементы.ДанныеСписания,,,,ОписаниеОповещения);
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти
